{
  "summary": "",
  "ascendant": "ASCENDANT — YOUR VIBE, AESTHETIC & OPENING SCENE ENERGY",
  "sun_sign": "SUN — YOUR CORE GENRE & MAIN CHARACTER ARCHETYPE",
  "sun_house": "SUN IN THE HOUSES — Where You Radiate\n→  The house your Sun lands in shows the stage where your soul wants to shine. It's your spotlight zone — the arena of life where you're meant to express your vitality, confidence, and creativity.",
  "moon_sign": "MOON — YOUR EMOTIONAL CLIMATE & INNER CINEMA",
  "moon_house": "MOON IN THE HOUSES — Your Emotional Habitat\n→ The house your Moon lives in shows where you seek comfort, safety, and emotional fulfillment. It's your inner world — the secret cinema of your soul.",
  "chart_ruler": "CHART RULER — WHO’S DIRECTING THE SCENE → Your chart ruler is the ruling planet of your Ascendant sign. Its sign and house show how your storyline unfolds and who’s directing the vibe behind the scenes.",
  "chart_ruler_houses": "CHART RULER IN THE HOUSES — WHERE YOUR STORY UNFOLDS → The house shows where the story unfolds. Below, each house takes on a unique aesthetic depending on its sign — aka, the set design of your cosmic stage.",
  "mercury_sign": "MERCURY — YOUR MENTAL EDITING ROOM & DIALOGUE STYLE",
  "mercury_house": "MERCURY IN THE HOUSES — Your Mind's Operating System\n→ Mercury shows how you think and speak — but the house shows what you're always thinking about. This is your inner narrator's favorite topic.",
  "venus_sign": "VENUS — YOUR LOVE AESTHETIC & ATTRACTION STYLE",
  "venus_house": "VENUS IN THE HOUSES — Love Language & Aesthetic Aura\n→ Venus shows what you find beautiful, how you attract love and pleasure, and what makes you feel adored. In each house, Venus reveals where you seek harmony and sparkle.",
  "mars_sign": "MARS — YOUR DRIVE, DESIRE & ACTION SEQUENCES",
  "mars_house": "MARS IN THE HOUSES — Your Drive, Fire & Fight\n→ Mars shows where you're bold, gutsy, and determined. This house is your arena of action — where you chase goals and stir up passion (or drama).",
  "jupiter_sign": "JUPITER — YOUR LUCK, FAITH AND EXPANSION ARCHETYPE",
  "jupiter_house": "JUPITER IN THE HOUSES — Where You Expand & Inspire\n→ The house shows where you radiate luck, growth, and Big Main Character Energy. Jupiter here says: go big or go cosmic.",
  "saturn_sign": "SATURN — YOUR TESTS, LIMITS AND LONG-GAME ROLE",
  "saturn_house": "SATURN IN THE HOUSES — Your Masterclass in Maturity\n→ Saturn shows where you face trials that build grit and wisdom. In this house, you're asked to grow up, do the work, and turn your fears into mastery.",
  "uranus_sign": "URANUS — YOUR REBEL FREQUENCY AND DISRUPTIVE GENIUS",
  "uranus_house": "URANUS IN THE HOUSES — Where You're a Cosmic Wild Card\n→ Your inner rebel, genius glitch, and lightning bolt of evolution.",
  "neptune_sign": "NEPTUNE — YOUR DREAM REALM AND GLAMOUR FIELD",
  "neptune_house": "NEPTUNE IN THE HOUSES — Where You Dream, Dissolve & Disappear\n→ The dream director in your chart, casting fog, fantasy, and spiritual downloads wherever it lands.",
  "pluto_sign": "PLUTO — YOUR POWER, DEPTH AND UNDERWORLD PLOT",
  "pluto_house": "PLUTO IN THE HOUSES — Where You Die & Rebirth, Obsess & Transform\n→ The shadow planet. Your underworld journey. The obsession that becomes your power.",
  "houses_in_signs": "HOUSES IN THE SIGNS — SET DESIGN FOR YOUR COSMIC STAGE → The house shows where the story unfolds. But the sign on the cusp tells us with what style. Below, each house takes on a unique aesthetic depending on its sign — aka, the set design of your cosmic stage."
}