{
  "Aries": "Venus in Aries — You flirt like a firestarter. Bold, direct, no time for games (unless they're chase scenes). You fall fast, dress loud, and kiss like a plot twist. Think red lips, leather jackets, and a love story that burns hot and fast.",
  "Taurus": "Venus in Taurus — Romance in slow motion. You seduce through scent, softness, and a perfectly curated dinner scene. Loyal, physical, and into the finer things — you're the kind of love story people write ballads about.",
  "Gemini": "Venus in Gemini — You're witty, flirty, and change costumes mid-movie. You love with your mind and keep it fresh with clever texts and endless curiosity. Your relationships need banter, books, and a soundtrack that never gets old.",
  "Cancer": "Venus in Cancer — Tender, nostalgic, a little shy at first. You love like a vintage family film: home-cooked meals, love letters, and eyes that say \"I remember everything.\" You crave security, but you also are the safe place.",
  "Leo": "Venus in Leo — You are the grand romantic gesture. Dramatic declarations, matching fits, and front row PDA. You don't fall in love — you star in it. You want admiration, loyalty, and a little cinematic sparkle.",
  "Virgo": "Venus in Virgo — You show love through acts of service, details, and making someone's life smoother. You're the one who edits their script, brings the right coffee, and remembers their allergies. Low-key luxe. Quiet devotion.",
  "Libra": "Venus in Libra — Aesthetic soulmate energy. You love beauty, harmony, and flirty eye contact across the room. You're all about balance — but also obsessed with the idea of us. Think: art museums, matching tattoos, stolen kisses.",
  "Scorpio": "Venus in Scorpio — Intense. Obsessive. Legendary. You seduce with silence and eye contact that melts steel. When you fall, you fall. Love becomes the plot. Your type? Complicated, magnetic, and maybe a little dangerous.",
  "Sagittarius": "Venus in Sagittarius — You love like a road trip. Spontaneous, hilarious, and slightly allergic to routine. You're into lovers who can teach you something — or at least make you laugh until your stomach hurts.",
  "Capricorn": "Venus in Capricorn — Old-school romance with power couple goals. You don't mess around. Loyalty, ambition, and shared calendars turn you on. You attract with status, style, and slow, steady devotion.",
  "Aquarius": "Venus in Aquarius — The unconventional lover. You love weird, wide, and with no rulebook. Friendships that turn into lovers, conversations that never end, and a style that's always one trend ahead.",
  "Pisces": "Venus in Pisces — The poet of passion. You fall in love like it's a song lyric. You crave soul-merging, escapist romance — the kind of love that feels like a film scored by Sufjan Stevens and shot on Super 8."
}

