{
  "Aries": "Ascendant in Aries — You walk into a room like an opening shot with fire. Direct, bold, and never background. Your style screams protagonist and your presence is pure ignition. You’re giving first-frame fighter energy.",
  "Taurus": "Ascendant in Taurus — Sensual slow zoom. You enter life like a luxury ad — earthy, elegant, and totally unbothered. People trust you without knowing why. Think cashmere, candlelight, and quiet power.",
  "Gemini": "Ascendant in Gemini — You speak before you speak. Flirty eyes, quick wit, unpredictable plotline. You’re the charismatic chatterbox that turns any scene into a subplot. Think montage of shifting outfits and changing accents.",
  "Cancer": "Ascendant in Cancer — Your aura is soft-focus nostalgia. Nurturing, intuitive, and a little mysterious. You make people feel like they’ve known you in a past life. Cozy-core main character with lunar vibes.",
  "Leo": "Ascendant in Leo — Lights, camera, you. You give main character energy before you even open your mouth. Big hair, bigger heart, and a cinematic presence that turns grocery shopping into a scene-stealer moment.",
  "Virgo": "Ascendant in Virgo — Clean, crisp, camera-ready. Your aesthetic is intentional and your vibe is 'just stepped out of a film with excellent writing.' You give detail-driven style and quiet magnetism.",
  "Libra": "Ascendant in Libra — You glide in like a perfectly lit scene. Charm, balance, beauty. Your whole life is shot in golden hour. People fall in love with you at first glance — and you know it.",
  "Scorpio": "Ascendant in Scorpio — You are the mystery. Penetrating gaze, slow reveal. People project onto you — but your real power is that you already know the ending. Think neo-noir icon with an emotional backstory.",
  "Sagittarius": "Ascendant in Sagittarius — You’re the wild shot in the trailer. Big laugh, wild outfit, eyes full of adventure. You exude optimism, chaos, and zero chill in the best way. Life is a road trip and you’re driving.",
  "Capricorn": "Ascendant in Capricorn — Cinematic authority. You command respect with a single look. Your style is sleek, structured, and legacy-coded. People assume you’re the boss — because you probably are.",
  "Aquarius": "Ascendant in Aquarius — You’re the wildcard. Eclectic, electric, and one-of-a-kind. You walk into scenes like a plot twist. Expect the unexpected — from your style to your story arc.",
  "Pisces": "Ascendant in Pisces — Dream sequence entrance. Ethereal, enchanting, and maybe not fully here. You dissolve into the room like a lyric or a hallucination. People want to know you — but never fully can."
}