{
    "1": "1st House — You are the story. Your presence, body, and personality lead every plotline. You’re here to be seen, known, and embodied. Life says: main character energy, always.",
    "2": "2nd House — Your self-worth, talents, and values are the heartbeat of your film. This is about building something real. Money, security, and the pleasure of ownership shape your role.",
    "3": "3rd House — Your voice is the vehicle. You write, talk, share, and connect. Life feels like a mixtape of dialogue scenes, short stories, and sibling subplots.",
    "4": "4th House — Your emotional roots, ancestry, and home life hold the narrative thread. This placement says: the private is the powerful. Think family drama with soul.",
    "5": "5th House — Your path is pleasure, romance, creativity, and spotlight. Life’s a talent show and you’re the headliner. This is your ‘look at me’ house — with heart.",
    "6": "6th House — Service, craft, and rituals guide your plot. You heal through helping, refine through repetition, and rise through routine. You’re the indie film with cult status.",
    "7": "7th House — Your growth comes through others. Relationships, mirrors, and contracts are the scenes that shape you. Love, law, or legacy — partnerships are everything.",
    "8": "8th House — Your life is a psychological thriller. Themes of sex, death, rebirth, and money intertwine. You’re built for transformation. Shadow work is your spotlight.",
    "9": "9th House — Your journey is philosophical, global, and spiritual. You’re the explorer, teacher, or preacher. Foreign films, higher learning, and big beliefs run the show.",
    "10": "10th House — Your destiny is public. Career, legacy, and impact are your keywords. You’re here to be known — not just liked. Fame, name, or reputation — your arc’s got goals.",
    "11": "11th House — You’re writing the future. Friends, causes, and big dreams carry you. This house is social, visionary, and a little sci-fi. Your path? Disruptive and collective.",
    "12": "12th House — You direct from the shadows. Private, psychic, and poetic — your growth happens off-screen. This is the spiritual studio. Isolation, dreams, and deep healing shape your silent revolution."
  }