{
  "Mars:1": "Chart Ruler in Aries — Bold, instinctive, and always on the go. Your life is a hot take and a fast cut. You act before thinking, but your drive leads the plot. Action hero energy.",
  "Venus:2": "Chart Ruler in Taurus — Slow and steady wins the aesthetic. You ground your story in comfort, sensuality, and lasting value. Think timeless classics, not viral trends.",
  "Mercury:3": "Chart Ruler in Gemini — Life is a conversation and you're always switching scenes. Curious, witty, and mentally restless, your inner director thrives on variety and edits fast.",
  "Moon:4": "Chart Ruler in Cancer — Your story is emotional cinema. You direct from memory, feeling, and intuition. The plot evolves through inner tides and deep connections.",
  "Sun:5": "Chart Ruler in Leo — Spotlight operator. You're here to shine, perform, and leave a legacy. You lead from the heart and your life reads like a bold, dramatic script.",
  "Mercury:6": "Chart Ruler in Virgo — The editor-in-chief. You polish every frame and fine-tune every detail. Your path is precise, productive, and focused on making sense of chaos.",
  "Venus:7": "Chart Ruler in Libra — You direct through aesthetics, relationships, and charm. Grace, diplomacy, and the art of balance shape your entire narrative arc.",
  "Mars:8": "Chart Ruler in Scorpio — You move in shadows and plot twists. Intense, strategic, and transformational — you direct with soul and secrecy. No scene is superficial.",
  "Jupiter:9": "Chart Ruler in Sagittarius — Big picture, big adventure. You're writing a global saga full of wisdom, road trips, and philosophical detours. Your director's chair has wheels.",
  "Saturn:10": "Chart Ruler in Capricorn — Structured, ambitious, and legacy-minded. Your story builds with time and intention. Think long-term plot with epic payoffs.",
  "Saturn:11": "Chart Ruler in Aquarius — Unpredictable, brilliant, and rebellious. You direct with vision and innovation. Expect genre-bending shifts and unconventional storytelling.",
  "Jupiter:12": "Chart Ruler in Pisces — The dream weaver. You blur fiction and reality, lead with compassion, and let intuition write the next scene. Mystical, magical cinema."
}

