{
  "Aries": "Mars in Aries — You act first, ask never. Your drive is pure ignition. You fight, flirt, and f*ck like the lead in a revenge thriller. You're bold, brash, and always ready to throw the first punch—or kiss.",
  "Taurus": "Mars in Taurus — Slow burn heat. You move with purpose, like a long take that never breaks eye contact. Once you're in, you commit. Your stamina is unmatched, your sensuality? Legendary.",
  "Gemini": "Mars in Gemini — Action meets dialogue. Your weapon is wit, and your fights are fast-paced banter. You move through life like a Tarantino character—clever, curious, chaotic in a charming way.",
  "Cancer": "Mars in Cancer — You fight for your people. Your passion comes from your gut and your loyalty is a power move. Think kitchen knives, emotional warfare, and soft-core rage with a cause.",
  "Leo": "Mars in Leo — You go hard, look good, and want the applause. Your drive is fueled by attention and passion. You take the stage, the lead, the lover — and you own it. Think steamy musicals and golden glow-ups.",
  "Virgo": "Mars in Virgo — Precision is your kink. You plan your moves like a heist film — exact, clean, effective. You're low-key lethal with high-key stamina. Sexy in a \"let me fix that for you\" way.",
  "Libra": "Mars in Libra — You fight fair — but you will win. Your motivation is harmony, but don't let the pretty face fool you. You'll outmaneuver your opponents with charm and style. Your action scenes are choreographed like a ballroom brawl.",
  "Scorpio": "Mars in Scorpio — Dangerous. Intense. Magnetic. You don't chase, you pull. Your drive is all or nothing, and when you want something — or someone — it becomes obsession-level. Think film noir, underworld thrillers, and eyes that could kill.",
  "Sagittarius": "Mars in Sagittarius — Unstoppable energy. You're here for the thrill, the freedom, the chase. Your life is an epic, your battles philosophical, and your sex scenes — spontaneous and unforgettable.",
  "Capricorn": "Mars in Capricorn — Silent killer vibes. You work hard, strike smart, and always have a long-term game plan. Your drive is relentless, your ambition sharp. You don't waste moves — or time.",
  "Aquarius": "Mars in Aquarius — Rebel rocket fuel. Your turn-ons are weird, wild, and one-of-a-kind. You fight with strategy, shock, and originality. Your action scenes come with a twist — and probably involve a drone.",
  "Pisces": "Mars in Pisces — Dreamy, elusive, seductive. Your fire comes in waves, and when it hits, it's pure fantasy. You move like smoke, love like art, and fight like a ghost in a fairytale."
}

