{
  "Aries": "Mercury in Aries — You speak in headlines and act like every thought is breaking news. Quick, punchy, and impatient — your dialogue has jump cuts and fire emojis. You say it like it is and leave people gasping.",
  "Taurus": "Mercury in Taurus — Your words have weight. You pause before you speak, but when you do — it sticks. Your communication is lush, calm, and built to last. Think classic narration, velvet voiceovers, and poetic realness.",
  "Gemini": "Mercury in Gemini — The screenwriter. You speak in GIFs, run ten tabs at once, and can hold a convo mid-chase scene. Clever, fast, and borderline chaotic — your mind is a writer's room with unlimited snacks.",
  "Cancer": "Mercury in Cancer — You speak from the heart. Intuitive, nostalgic, and a little psychic. Your voice sounds like a love letter. Your thoughts? Anchored in feeling. You remember everything — and will quote it back in tears.",
  "Leo": "Mercury in Leo — Your mind is a stage. You tell stories like they’re Oscar speeches. Bold, persuasive, and meme-worthy. You don’t just talk — you perform. Think dramatic monologues and unforgettable lines.",
  "Virgo": "Mercury in Virgo — You’re the editor-in-chief. Razor-sharp, observant, and always five steps ahead. Your brain is a spreadsheet disguised as a script. You notice typos, subtext, and red flags — before they make it to the final cut.",
  "Libra": "Mercury in Libra — Diplomatic AF. You speak in italics and balance. Charming, fair, and able to mediate plot-twists mid-dialogue. Your words are coated in honey and tailored in couture.",
  "Scorpio": "Mercury in Scorpio — You don’t just talk — you interrogate. Deep thinker, emotional detective, truth excavator. What you say is loaded. What you don’t say? Even louder. You're the subtext specialist.",
  "Sagittarius": "Mercury in Sagittarius — You talk like a world map. Honest, funny, philosophical. Your thoughts wander continents, and your opinions come with subtitles. Unfiltered wisdom with stand-up comedy delivery.",
  "Capricorn": "Mercury in Capricorn — The executive producer. Strategic, structured, and strictly no BS. You say what matters. You think in bullet points and talk like you already closed the deal.",
  "Aquarius": "Mercury in Aquarius — You broadcast from the future. Innovative, offbeat, and slightly alien — you speak in genius. Your ideas are strange until they become iconic. Think TED Talks meets Tumblr threads.",
  "Pisces": "Mercury in Pisces — Dream-speak. You talk in metaphors, lyrics, and soul static. Intuitive, foggy, magical. Your mind lives in a surreal film, and your voice is always one piano note away from tears."
}