{
  "Aries": "Moon in Aries — Raw. Loud. Fast cuts. You feel like an action sequence with no stunt double. Your inner world is spicy, impulsive, and passionate AF. You love hard, rage quick, and move on like a firework.",
  "Taurus": "Moon in Taurus — Soft focus. Candlelight. A bathtub scene with Sade playing. You crave comfort like cinema craves lighting. Loyal and sensuous, your feelings take their sweet time — but once you’re in, it’s eternal.",
  "Gemini": "Moon in Gemini — Talking to yourself in voiceover. Plot twists in your journal. You feel your feelings through thinking, texting, memeing. Restless but witty, you’re the main character and the comic relief.",
  "Cancer": "Moon in Cancer — You are the movie hug. The rainy scene. The childhood flashback. Sentimental to the core, your emotions run deep, loyal, and tied to your past. Family dramas and love letters are your genre.",
  "Leo": "Moon in Leo — Emotional grand entrances. The spotlight is your therapy. You express your heart through glam, generosity, and bold declarations. Cue the standing ovation after your vulnerable monologue.",
  "Virgo": "Moon in Virgo — Interior monologue in Helvetica font. You process feelings like you proofread scripts: precise, practical, maybe too hard on yourself. But you show love in helpful, healing, deeply thoughtful ways.",
  "Libra": "Moon in Libra — Balanced lighting. Harmonious scores. You need peace like the third act needs resolution. Your feelings want connection, beauty, and someone to slow dance with in the kitchen.",
  "Scorpio": "Moon in Scorpio — Secret scenes. Emotional plot twists. You feel like a Lana Del Rey ballad played in reverse. Intense, private, and loyal beyond reason, your inner world is deep AF — and maybe a little dangerous.",
  "Sagittarius": "Moon in Sagittarius — Your heart is a backpack. You feel best when you're expanding: learning, laughing, or planning your next adventure. Big emotions, big laughs, and a sense of humor that saves the day.",
  "Capricorn": "Moon in Capricorn — The cool protagonist who finally breaks down in act three. You feel deeply but show selectively. Loyal, grounded, and tough on the outside, you carry legacy like it's a love language.",
  "Aquarius": "Moon in Aquarius — The alien in the love story. Detached but devoted. You feel in waves—just not like everyone else. Your emotions show up through friendship, vision, and the desire to change the script.",
  "Pisces": "Moon in Pisces — Soft filters. Tear-stained art. The daydreamer’s diary. Your emotions don’t play by logic—they play by music. You're a sponge for the room, the dreamer of dreams, and the poet of pain."
}