{
  "Aries": "Neptune in Aries — Your dreams move fast. You chase vision like it's an extreme sport. You fantasize about being the hero, the pioneer, the one who does what no one's done before. Think mythic beginnings and cinematic rebirths.",
  "Taurus": "Neptune in Taurus — Aesthetic dreamer. You see heaven in textures, tastes, and tones. Your fantasy realm looks like an A24 perfume ad. Nature, luxury, and love that lingers like a perfect scent.",
  "Gemini": "Neptune in Gemini — Your illusions talk. You're a surreal storyteller, a script-flipper, a dreamweaver of words. Your mind wanders into poetic riddles, secret messages, and phone calls that happen in dreams.",
  "Cancer": "Neptune in Cancer — You are nostalgia personified. Your dreams live in lullabies and rainy windows. You crave a safe place — or dream about building one. A deeply psychic emotional sponge with a filmic eye for memory.",
  "Leo": "Neptune in Leo — Your fantasy is fame — not just any fame, but the divine, unforgettable, cinematic kind. You romanticize yourself into an icon. Your life = a montage scene set to your own soundtrack.",
  "Virgo": "Neptune in Virgo — You dream in details. Fantasies of healing, purity, and perfection dance behind your daily routines. When you let go of control, your magic flows through rituals, herbs, and service disguised as stardust.",
  "Libra": "Neptune in Libra — Eternal romantic. You believe in the soulmate, the aesthetic kiss, the perfectly framed love story. You lose yourself in beauty, partnerships, and the soundtrack of a shared glance.",
  "Scorpio": "Neptune in Scorpio — Intoxicating mystic. You dream in shadows, lust, and secrets. Obsession meets intuition. Your fantasies are intense, erotic, and transformative — like falling in love with your own shadow.",
  "Sagittarius": "Neptune in Sagittarius — Your dreams are passports. Fantasies of freedom, foreign lands, and higher truths. You worship wanderlust. You long to merge with meaning — through culture, philosophy, or just a wild road trip.",
  "Capricorn": "Neptune in Capricorn — You dream of empires — the aesthetic ones. You build your fantasies from legacy, structure, and style. You're the architect of ethereal goals. Visionary, but grounded in the glam.",
  "Aquarius": "Neptune in Aquarius — You dream in code and community. Your fantasies include future tech, soulmates you haven't met yet, and making the world better through art and rebellion. Stardust meets science.",
  "Pisces": "Neptune in Pisces — This is home. You are the dream incarnate. Your world is made of fog, feelings, music, and magic. You dissolve into the collective and return with a poem. Your presence is a portal."
}