{
  "1": "Neptune in the 1st House — Your whole vibe is otherworldly. People project fantasies onto you. You're a shapeshifter with mystical charisma. Identity? A fluid concept.",
  "2": "Neptune in the 2nd House — You value the intangible. Money can slip through your fingers unless it's tied to art, healing, or spirit work. You crave beauty and soul over stuff.",
  "3": "Neptune in the 3rd House — Your voice = spellwork. You speak in metaphor, daydream during convos, and blur fact and fiction with poetic ease. Dreamy mind, mystical thoughts.",
  "4": "Neptune in the 4th House — Foggy childhood or a home that felt like a dream (or a mirage). You long for emotional escape, nostalgia, and sacred sanctuary. Psychic connection to ancestors.",
  "5": "Neptune in the 5th House — Your creativity is divine. You fall in love with a fantasy and express yourself like a romantic poet on absinthe. Art, glam, and illusion are your love languages.",
  "6": "Neptune in the 6th House — Work, boundaries, and daily life can feel blurry. You might need rest, solitude, or spiritual work to function. Healing = intuitive, not logical.",
  "7": "Neptune in the 7th House — You romanticize your partners hard. Love can be transcendent—or totally delusional. You attract soulful, artistic, or slippery types.",
  "8": "Neptune in the 8th House — Mysticism, taboos, and psychic sex appeal. You merge on spiritual levels, and sense other people's desires. Boundaries are essential.",
  "9": "Neptune in the 9th House — You're a cosmic philosopher. Your beliefs are mystical, not dogmatic. You dream of spiritual travel, divine truth, and oneness with the universe.",
  "10": "Neptune in the 10th House — Public image = glamorous, elusive, or confusing. You may pursue a creative or healing career, or become famous for something dreamlike or iconic.",
  "11": "Neptune in the 11th House — You're drawn to dreamers, artists, and visionaries. Your idealism about community can be both inspiring and overwhelming. You want to save the world.",
  "12": "Neptune in the 12th House — You're deeply psychic, spiritually porous, and connected to realms beyond. Dreams, solitude, and surrender are your recharge zones. Total mystic energy.."
}