{
  "Aries": "Pluto in Aries — You were born with boss-level intensity. Your shadow battles are about domination, control, and unleashing your raw will without burning bridges. When you transform, it's explosive—but you rise as a fearless leader.",
  "Taurus": "Pluto in Taurus — Obsessed with control, comfort, and never being vulnerable again. You're here to transform your relationship with money, beauty, and security. You become powerful when you let go of the need to own and instead choose to embody value.",
  "Gemini": "Pluto in Gemini — Words are weapons. Your obsessions lie in understanding, decoding, and dissecting everything. You transform through your thoughts — sometimes destructively. But when you own your voice? You're a revolution waiting to publish.",
  "Cancer": "Pluto in Cancer — Your past haunts you like a gothic family film. Power struggles around home, motherhood, and emotional safety are your battleground. You're here to turn generational trauma into generational healing.",
  "Leo": "Pluto in Leo — Fame. Ego. Identity. You've danced with the shadow of spotlight addiction. Your real power comes when you create not for applause — but from truth. Once you master your ego, you become legendary.",
  "Virgo": "Pluto in Virgo — The fixer with a dark edge. Obsessive, analytical, and hard to please — especially yourself. Your transformation comes when you surrender perfection and channel your gifts into deep service and soulful systems.",
  "Libra": "Pluto in Libra — Relationships are your battlefield. You crave connection but fear losing control. You're here to break co-dependency, rewrite love scripts, and step into magnetic equality. Power couples, not power plays.",
  "Scorpio": "Pluto in Scorpio — This is home turf. You are the embodiment of death and rebirth. Intense, magnetic, emotionally x-ray vision. You transform others just by existing. When you learn to wield your power with compassion? You're unstoppable.",
  "Sagittarius": "Pluto in Sagittarius — Obsessed with truth, freedom, and cosmic meaning. You destroy belief systems — yours and others — and rebuild them stronger. You're the philosopher-phoenix with a passport and a prophecy.",
  "Capricorn": "Pluto in Capricorn — You're here to dismantle toxic systems — especially the ones you built. You fear failure and crave legacy, but your true evolution lies in redefining what power even means. Think CEO turned spiritual teacher.",
  "Aquarius": "Pluto in Aquarius — The revolutionary. You're obsessed with change, progress, and breaking every rule that binds humanity. You came to shake the system. Your power lies in awakening the collective — no matter how weird it gets.",
  "Pisces": "Pluto in Pisces — A mystic with shadowy depths. Your obsessions lie in transcendence, sacrifice, fantasy, and escapism. You transform through surrender — and when you do, you become a healing portal through art, dreams, and soul."
}