{
  "1": "Pluto in the 1st House — You're intense AF. People feel your power before you speak. Life has taught you to evolve through your identity — shedding skins, rebirthing your vibe. Magnetic. Unapologetic.",
  "2": "Pluto in the 2nd House — Your values and money stories are tied to control and survival. You may fear lack — or become obsessed with wealth. Once healed, you become a powerful manifestor of tangible self-worth.",
  "3": "Pluto in the 3rd House — Your words can cut, heal, or hypnotize. You think in x-rays, detecting what others miss. Transformation comes through your voice, ideas, and sometimes power struggles with siblings or your inner critic.",
  "4": "Pluto in the 4th House — A deep, possibly turbulent family past. Home life shaped you with intensity. You carry ancestral wounds — and also the power to heal them. You're a phoenix rising from the family ashes.",
  "5": "Pluto in the 5th House — Love is all-consuming, creativity is raw and obsessive, and your inner child is a powerhouse once reborn. You don't date — you get entangled. You don't create — you pour your soul into the fire.",
  "6": "Pluto in the 6th House — Work, health, and habits = places of major transformation. You're the master of reinvention through your routines. You may have battled illness, addiction, or burnout — and emerged reborn.",
  "7": "Pluto in the 7th House — Relationships are your crucible. Power dynamics, possessiveness, or betrayal may test you — but also teach you your worth. When you own your power, you attract truly transformative love.",
  "8": "Pluto in the 8th House — You're the witch, the healer, the alchemist. You have an uncanny gift for depth, desire, and taboo territory. Death and rebirth are your jam. Psychic and intensely private.",
  "9": "Pluto in the 9th House — You challenge dogma and burn down false belief systems. Your path: seeking truth that transforms. You could become obsessed with philosophy, spirituality, or higher education — and change the world through it.",
  "10": "Pluto in the 10th House — Career = your empire of power. You're here to rise from the ashes and claim your space at the top. Fame and success come with intensity — and a need to stay true to your integrity.",
  "11": "Pluto in the 11th House — Friendships, communities, and movements are where you hold and wield power. You attract intense alliances — or face betrayals. You're a revolutionary when you step into your authentic voice.",
  "12": "Pluto in the 12th House — The subconscious is your underworld. Your shadows run deep — but so does your magic. Power lies in surrendering to the unknown, healing karmic patterns, and becoming whole through soulwork."
}