{
  "Aries": "Saturn in Aries — You came to learn patience, not war. You're here to master boldness with boundaries. Your lesson? Assert without aggression. You age into a quiet kind of power — like the hero who finally puts down the sword.",
  "Taurus": "Saturn in Taurus — You're learning how to build a legacy brick by brick. Money, security, and self-worth don't come easy — but when they do, they stay. Slow grind. Real reward. Luxe with lessons.",
  "Gemini": "Saturn in Gemini — Communication takes work. You might second-guess your voice, but your genius lies in crafting your message. Learn the language of truth, and your words will become gospel.",
  "Cancer": "Saturn in Cancer — Feelings aren't weak — they're sacred. Your lesson is to let love in, nurture without over-nesting, and become your own safe place. Emotional maturity becomes your superpower.",
  "Leo": "Saturn in Leo — Validation doesn't equal value. You're here to learn how to shine without needing the applause. Once you do — damn, your inner glow is unstoppable.",
  "Virgo": "Saturn in Virgo — You're your own harshest critic. Perfectionism is your poison and your polish. You're learning how to trust the process, not just the plan. Your legacy is in the details.",
  "Libra": "Saturn in Libra — Boundaries are beautiful. You're here to learn how to relate with grace and strength. Love isn't always fairytales — sometimes it's contracts, compromise, and choosing peace over performance.",
  "Scorpio": "Saturn in Scorpio — Transformation hurts — but it's where your power lives. You're here to face the shadows, release the need to control, and rise from the ruins like a cinematic legend.",
  "Sagittarius": "Saturn in Sagittarius — You're learning how to aim before you leap. Your challenge? Turning restlessness into wisdom. Your legacy? Teaching truth with lived experience — like a globe-trotting philosopher.",
  "Capricorn": "Saturn in Capricorn — You came to carry the crown. But first, you had to earn it. You're here to turn ambition into legacy — not just status. You mature young, lead well, and age like a CEO in vintage Armani.",
  "Aquarius": "Saturn in Aquarius — You're here to break the rules — responsibly. You're learning how to balance revolution with responsibility. The rebel becomes the architect of the future.",
  "Pisces": "Saturn in Pisces — Boundaries are your biggest lesson. You're learning how to hold the dream without dissolving in it. Once you do, your art, empathy, and wisdom become legendary."
}
