{
  "summary": "",
  "ascendant": "ASCENDANT — YOUR VIBE, AESTHETIC & OPENING SCENE ENERGY",
  "sun_sign": "SUN — YOUR CORE GENRE & MAIN CHARACTER ARCHETYPE",
  "sun_house": "SUN IN THE HOUSES — WHERE YOUR CORE LIGHT PLAYS OUT",
  "moon_sign": "MOON — YOUR EMOTIONAL CLIMATE & INNER CINEMA",
  "moon_house": "MOON IN THE HOUSES — HOW YOUR FEELINGS MOVE THROUGH LIFE",
  "chart_ruler": "CHART RULER — WHO’S DIRECTING THE SCENE → Your chart ruler is the ruling planet of your Ascendant sign. Its sign and house show how your storyline unfolds and who’s directing the vibe behind the scenes. Below are the chart rulers in each sign, decoding how your character arc flows:",
  "chart_ruler_houses": "CHART RULER IN THE HOUSES — WHERE YOUR STORY UNFOLDS → The house shows where the story unfolds. Below, each house takes on a unique aesthetic depending on its sign — aka, the set design of your cosmic stage.",
  "mercury_sign": "MERCURY — YOUR MENTAL EDITING ROOM & DIALOGUE STYLE",
  "mercury_house": "MERCURY IN THE HOUSES — WHERE YOUR VOICE LANDS",
  "venus_sign": "VENUS — YOUR LOVE AESTHETIC & ATTRACTION STYLE",
  "venus_house": "VENUS IN THE HOUSES — WHERE AND HOW YOU LOVE",
  "mars_sign": "MARS — YOUR DRIVE, DESIRE & ACTION SEQUENCES",
  "mars_house": "MARS IN THE HOUSES — WHERE YOU PUSH, FIGHT AND CHASE",
  "jupiter_sign": "JUPITER — YOUR LUCK, FAITH AND EXPANSION ARCHETYPE",
  "jupiter_house": "JUPITER IN THE HOUSES — WHERE LIFE WANTS TO GROW",
  "saturn_sign": "SATURN — YOUR TESTS, LIMITS AND LONG-GAME ROLE",
  "saturn_house": "SATURN IN THE HOUSES — WHERE YOU’RE BUILDING STRUCTURE",
  "uranus_sign": "URANUS — YOUR REBEL FREQUENCY AND DISRUPTIVE GENIUS",
  "uranus_house": "URANUS IN THE HOUSES — WHERE YOU SHAKE THINGS UP",
  "neptune_sign": "NEPTUNE — YOUR DREAM REALM AND GLAMOUR FIELD",
  "neptune_house": "NEPTUNE IN THE HOUSES — WHERE THINGS GET SURREAL",
  "pluto_sign": "PLUTO — YOUR POWER, DEPTH AND UNDERWORLD PLOT",
  "pluto_house": "PLUTO IN THE HOUSES — WHERE YOU TRANSFORM FROM WITHIN",
  "houses_in_signs": "HOUSES IN THE SIGNS — SET DESIGN FOR YOUR COSMIC STAGE → The house shows where the story unfolds. But the sign on the cusp tells us with what style. Below, each house takes on a unique aesthetic depending on its sign — aka, the set design of your cosmic stage."
}