{
  "Aries": "Sun in Aries — The Action Hero. Born to lead, born to win. Think: leather jacket, red Mustang, hair always a little messy from speed. You’re the first on the call sheet and the last to back down. Your cinematic essence? Explosions, adrenaline, and a go-getter glare that says \"my story starts now.\"",
  "Taurus": "Sun in Taurus — The Sensual Starlet. You enter scenes like a slow zoom: rich, textured, deliberate. You are the feast, the velvet, the linger. Your movies are about luxury, loyalty, and knowing your worth. You don’t chase roles—you attract them.",
  "Gemini": "Sun in Gemini — The Trickster Icon. You’re quicksilver dialogue, razor-sharp edits, and three subplots running at once. A master of reinvention, you play every part. Think screwball comedies, rom-coms, and a plot twist voiceover at the end.",
  "Cancer": "Sun in Cancer — The Emotional Auteur. Tender, moody, nostalgic. You are the vintage montage. The kitchen scene. The lover holding on. Your plotline runs on intuition and big watery eyes that make even villains fall in love.",
  "Leo": "Sun in Leo — The Drama Queen. Cue the lights. You don’t just star in films—you are the genre. Your presence says epic. You’re bold, golden, unforgettable. Everything is main character energy with awards-season outfits.",
  "Virgo": "Sun in Virgo — The Script Doctor. Your scenes are crisp, calculated, and meaningful. You don’t just act—you edit. You serve clever lines, quiet glances, and subtle genius that critics love and the internet sleeps on (until later).",
  "Libra": "Sun in Libra — The Rom-Com Protagonist. Pretty, witty, and obsessed with symmetry. Your films are full of flirtation, aesthetic brilliance, and the eternal dilemma: do I choose the brooding one or the nice one?",
  "Scorpio": "Sun in Scorpio — The Noir Mystery. You don’t play characters. You haunt them. Your presence lingers like smoke. Think psychological thrillers, femme fatales, and secret backstories no one sees coming.",
  "Sagittarius": "Sun in Sagittarius — The Wildcard Adventurer. Your genre? Road movies, philosophy docs, and desert scenes at sunset. You need motion, ideas, and freedom. Your whole life is a coming-of-wisdom film.",
  "Capricorn": "Sun in Capricorn — The Power Player. You age in reverse—born serious, growing rebellious. Think: prestige dramas, legacy stories, antiheroes who build empires and don’t need approval (but secretly want the Oscar).",
  "Aquarius": "Sun in Aquarius — The Cult Classic. Strange. Iconic. Timeless. You’re the protagonist nobody expects but everybody remembers. Your movies break form, your characters challenge norms, and your style is 3024.",
  "Pisces": "Sun in Pisces — The Dream Sequence. You exist between timelines. Half siren, half poet. Think Sofia Coppola meets Studio Ghibli. You don’t act—you feel. The plot dissolves around your aura."
}