{
    "Aries": "Uranus in Aries — You're the plot twist no one saw coming. Bold, brash, and always two steps ahead, your rebellion is physical. You break rules by doing. Expect sudden moves, viral moments, and impulsive genius.",
    "Taurus": "Uranus in Taurus — Disrupting comfort zones with style. You rebel through art, money, and sensuality. Your shock factor? Turning tradition into something radical. Think sustainable glamour and luxe revolutions.",
    "Gemini": "Uranus in Gemini — The glitch in the script. Your thoughts are lightning bolts. You shock through words, pranks, tweets, and brilliant clapbacks. You’re the wild card in every group chat.",
    "Cancer": "Uranus in Cancer — Emotional rebel. You challenge ideas of family, gender roles, and what home should be. Your superpower is breaking ancestral patterns and rebuilding them from love.",
    "Leo": "Uranus in Leo — You're iconoclastic royalty. You challenge the cult of celebrity while secretly inventing it. Your creativity shocks, your presence disrupts — you're the scene-stealer and the trend-breaker.",
    "Virgo": "Uranus in Virgo — Chaos in the details. You disrupt through systems, routines, and logic. Your innovation is precise, sharp, and revolutionary in a minimalist way. Think sci-fi librarians and punk analysts.",
    "Libra": "Uranus in Libra — Your rebellion is romantic. You rewrite love stories, question relationship rules, and challenge the aesthetics of the status quo. Beauty as resistance. Balance with a zap.",
    "Scorpio": "Uranus in Scorpio — Electric intensity. You rebel in the shadows. Your power to shake things up comes from taboo truths, emotional risk, and fearless transformation. Sexy, secretive, and subversive.",
    "Sagittarius": "Uranus in Sagittarius — The cosmic joker. You challenge belief systems with humor, wild ideas, and philosophical pranks. You’re the rogue guru, the intellectual rebel, and the wanderer who refuses maps.",
    "Capricorn": "Uranus in Capricorn — You disrupt the patriarchy from the inside. You’re here to upgrade outdated institutions with strategic genius. CEO of rebellion. Boardroom anarchist. Think suit, but make it subversive.",
    "Aquarius": "Uranus in Aquarius — You are the future. Tech visionary, social disruptor, and alien muse. You don’t follow rules — you download new ones. Expect sudden downloads, genius sparks, and collective breakthroughs.",
    "Pisces": "Uranus in Pisces — The surrealist rebel. You break boundaries through dreams, illusions, and spiritual shakeups. Your power lies in dissolving limits — with art, intuition, and otherworldly weirdness."
  }