{
  "1": "Uranus in the 1st House — You are the plot twist. You're eccentric, magnetic, and a rule-breaker by nature. People never know what version of you they'll get — and you like it that way.",
  "2": "Uranus in the 2nd House — Money comes and goes like Wi-Fi. You're inventive with how you earn it — crypto, side hustles, genius ideas. You value freedom over stability.",
  "3": "Uranus in the 3rd House — Your mind moves at the speed of lightning. You communicate like a genius alien channeling downloads. Unpredictable texts, brilliant ideas, strange tangents.",
  "4": "Uranus in the 4th House — Your home or childhood wasn't conventional — maybe unstable, maybe liberating. As an adult, you crave space and need to do domestic life your way.",
  "5": "Uranus in the 5th House — Artist of the absurd. You create like a mad scientist. Love is sudden, thrilling, chaotic. You don't chase — you shock, dazzle, and disappear.",
  "6": "Uranus in the 6th House — Daily life must be flexible. You can't do boring routines — you thrive on spontaneity. You may work in tech, reform systems, or revolutionize wellness.",
  "7": "Uranus in the 7th House — You attract very unique partners. Relationships need freedom and mental chemistry. May have sudden breakups or meet lovers through wild synchronicities.",
  "8": "Uranus in the 8th House — Your sexuality is avant-garde, electric, and transformative. You disrupt taboos and dive deep into forbidden knowledge. Nothing surface-level will do.",
  "9": "Uranus in the 9th House — Your beliefs are off the grid. You might rebel against religion, create your own philosophy, or travel in radically unconventional ways. Global disruptor energy.",
  "10": "Uranus in the 10th House — You're destined to shake up your industry. Public life comes with curveballs and reinventions. Fame or status arrives through your uniqueness.",
  "11": "Uranus in the 11th House — You were born to lead collectives and communities of misfits. You're the innovator, activist, or visionary in your squad. You're all about the future.",
  "12": "Uranus in the 12th House — Your weirdness is cosmic. You receive wild insights through dreams, solitude, or intuitive flashes. You may keep your genius hidden — until it explodes."
}